feat(docs): update the docs
